Охотники_и_рыболовы/src/DataProcessors/УстановкаСезонаОхоты/УстановкаСезонаОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаСезонаОхоты</name>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Охотники_и_рыболовы/src/InformationRegisters/УстановленныеДатыСезонаОхоты/УстановленныеДатыСезонаОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеДатыСезонаОхоты</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Catalogs/СезоныОхоты/СезоныОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СезоныОхоты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/DataProcessors/УстановкаСезонаОхоты/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ВЫБОР
		  |		КОГДА РазрешениеНаОхоту.Ссылка ЕСТЬ NULL 
		  |			ТОГДА ЛОЖЬ
		  |		КОГДА УстановкаКвотНаОхотхозяйство.Ссылка ЕСТЬ NULL 
		  |			ТОГДА ЛОЖЬ
		  |		КОГДА УстановкаОбщихКвот.Ссылка ЕСТЬ NULL 
		  |			ТОГДА ЛОЖЬ
		  |		ИНАЧЕ ИСТИНА
		  |	КОНЕЦ КАК ЕстьДанные,
		  |	СезоныОхоты.Ссылка,
		  |	СезоныОхоты.ДатаНачала,
		  |	СезоныОхоты.ДатаОкончания,
		  |	СезоныОхоты.СезонЗакрыт
		  |ИЗ
		  |	РегистрСведений.УстановленныеДатыСезонаОхоты КАК ДатыСезонаОхоты
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаКвотНаОхотхозяйство КАК УстановкаКвотНаОхотхозяйство
		  |		ПО ДатыСезонаОхоты.СезонОхоты = УстановкаКвотНаОхотхозяйство.СезонОхоты
		  |			И (НЕ УстановкаКвотНаОхотхозяйство.ПометкаУдаления)
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
		  |		ПО ДатыСезонаОхоты.СезонОхоты = РазрешениеНаОхоту.СезонОхоты
		  |			И (НЕ РазрешениеНаОхоту.ПометкаУдаления)
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаОбщихКвот КАК УстановкаОбщихКвот
		  |		ПО ДатыСезонаОхоты.СезонОхоты = УстановкаОбщихКвот.СезонОхоты
		  |			И (НЕ УстановкаОбщихКвот.ПометкаУдаления)
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СезоныОхоты КАК СезоныОхоты
		  |		ПО ДатыСезонаОхоты.СезонОхоты = СезоныОхоты.Ссылка";

	
	Если ТекущийСезон.Пустая() Тогда
			Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой()	Тогда
			///СезоныВБазеРеквизитФормыВЗначение("Сезоны",Тип("ТаблицаЗначений"));
			СезоныВБазе = Результат.Выгрузить();
			ЗначениеВРеквизитФормы(СезоныВБазе,"Сезоны");
			//ТекущаяДата = ТекущаяДата();
			
			//Для каждого стр из Сезоны Цикл
			//	Если ТекущаяДата >= стр.ДатаНачала И ТекущаяДата <= стр.ДатаОкончания Тогда
			//		ТекущийСезон = стр.Ссылка;
			//		ОбъектЗначение = стр.Ссылка.ПолучитьОбъект();
			//		ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
			//	КонецЕсли;	
			//КонецЦикла;
	   
		КонецЕсли;
	Иначе
		Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ ДатыСезонаОхоты.СезонОхоты = &ТекущийСезон";
		Запрос.УстановитьПараметр("ТекущийСезон",ТекущийСезон);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			а=0;
		Иначе
			
			стр = Результат.Выгрузить()[0];
			ОбъектЗначение = стр.Ссылка.ПолучитьОбъект();
			ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                                        
Процедура УстановитьДоступностьКнопок() Экспорт
	Если Объект.Ссылка.Пустая() ИЛИ Объект.СезонЗакрыт Тогда
		Элементы.ФормаОткрытьСезон.Доступность = Истина;
		Элементы.ФормаЗакрытьСезон.Доступность = Ложь;	
	Иначе 
		Элементы.ФормаОткрытьСезон.Доступность = Ложь;	
		Элементы.ФормаЗакрытьСезон.Видимость = Истина;	
		Элементы.ФормаЗакрытьСезон.Доступность = Истина;
		Элементы.Группа1.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещение(ТекстВопроса,ПроцедураОбработки,стр = Неопределено) 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения(ПроцедураОбработки, ЭтаФорма, стр);
	ПоказатьВопрос(Оповещение,ТекстВопроса , Режим, 0);

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопроса(Результат, стр) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
		ТекстСообщения = "Текущий сезон не установлен";
		Поле = "Объект.СезонОхоты";
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Возврат;
	Иначе
		Если НЕ стр = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект,стр);
		КонецЕсли;	
		ВыполнитьДействие("ОткрытьСезон");
		ОповеститьОЗаписиНового(Объект.Ссылка);
		ПриОткрытии(Ложь);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ВыполнитьДействие(Действие)
	//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Действие = "ЗакрытьСезон" Тогда 
		Объект.СезонЗакрыт = Истина;
	ИначеЕсли Действие = "ОткрытьСезон" Тогда
		Объект.СезонЗакрыт = Ложь;
	КонецЕсли;	
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект",Тип("СправочникОбъект.СезоныОхоты"));
	
	Если НЕ ОхотаСервер.ИзменитьСезон(ОбъектЗначение,Действие) Тогда
		ПоказатьНаСервере("Записать не удалось","Объект.Ссылка");
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
		
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОткрытьСезон(Команда)
	
	Если НЕ Объект.Ссылка.Пустая() И Объект.СезонЗакрыт Тогда
		ТекстВопроса = "Сезон охоты был закрыт. Вы хотите открыть его заново?";
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса");
	Иначе
		ВыполнитьДействие("ОткрытьСезон");
	КонецЕсли;
	ПоказатьОповещениеПользователя("Текущий сезон был успешно открыт",,,);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗакрытьСезон(Команда)
	Если Объект.СезонЗакрыт Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДействие("ЗакрытьСезон");
	ОповеститьОбИзменении(Объект.Ссылка);
	ПоказатьОповещениеПользователя("Текущий сезон был успешно закрыт");
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Поле = "Объект.ДатаНачала";

	Если Объект.ДатаНачала = '00010101' Тогда
	ТекстСообщения = "Заполните дату начала сезона";
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Объект.ДатаНачала = '00010101';
		Возврат;
	КонецЕсли;
	
	//ОбъектЗначение = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.УстановкаСезонаОхоты"))
	Для каждого стр из Сезоны Цикл
		Если стр.СезонЗакрыт 
			И Объект.ДатаНачала >= стр.ДатаНачала И Объект.ДатаНачала <=стр.ДатаОкончания Тогда
		ТекстВопроса = "Сезон охоты был закрыт. Вы хотите открыть его заново?";
		СоздатьОповещение(ТекстВопроса,"ПослеЗакрытияВопроса",стр);
		Возврат;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПолеДатаНачала = "Объект.ДатаНачала";
	Поле = "Объект.ДатаОкончания";
	
	Если Объект.ДатаОкончания = '00010101' Тогда
		ТекстСообщения = "Заполните дату окончания сезона";
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Возврат;
	ИначеЕсли  (Объект.ДатаНачала) > (Объект.ДатаОкончания) Тогда
		ТекстСообщения = "Окончание сезона не может быть раньше начала";
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Объект.ДатаОкончания = '00010101';
		Возврат;
	ИначеЕсли  (Год(Объект.ДатаОкончания) - Год(Объект.ДатаНачала)) > 1  Тогда
		ТекстСообщения = "Сезон охоты не может быть больше года";	
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Объект.ДатаОкончания = '00010101';
		Возврат;
	ИначеЕсли  (Год(Объект.ДатаОкончания) = Год(Объект.ДатаНачала)) Тогда
		ТекстСообщения = "Сезон охоты должен оканчиваться в следующем году";	
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Объект.ДатаОкончания = '00010101';
		Возврат;	
	КонецЕсли;
	
	Для каждого стр из Сезоны Цикл
		Если стр.СезонЗакрыт 
			И Объект.ДатаОкончания >= стр.ДатаНачала И Объект.ДатаНачала <=стр.ДатаОкончания Тогда
		ТекстСообщения = "Дата окончания попала в закрытый сезон";	
		ПоказатьНаСервере(ТекстСообщения,Поле);
		Объект.ДатаНачала = '00010101';
		Возврат;
		КонецЕсли;
	КонецЦикла;
	Элементы.ФормаОткрытьСезон.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьКнопок();
КонецПроцедуры
